/**
 * Created by hebin on 2015/11/6.
 */


var search = require("./search");
var http = require("http");
var cheerio = require("cheerio");
var FlowerDao = require("../models/flower");
var utils = require("../tools/utils");
var succulent_plants = [
    "虎刺梅"
    , "雷神"
    , "金手指"
    , "仙人掌"
    , "昙花"
    , "仙人球"
    , "生石花"
    , "宝石花"
    , "蟹爪兰"
    , "虹之玉"
    , "碰碰香"
    , "燕子掌"
    , "熊童子"
    , "黑法师"
    , "雅乐之舞"
    , "金琥"
    , "玉扇"
    , "火祭"
    , "星美人"
    , "子持莲华"
    , "黄丽"
    , "令箭荷花"
    , "玉蝶"
    , "桃美人"
    , "佛甲草"
    , "八宝景天"
    , "垂盆草"
    , "鹿角海棠"
    , "不夜城芦荟"
    , "珍珠吊兰"
    , "麒麟掌"
    , "八千代"
    , "碧光环"
    , "姬星美人"
    , "宝草"
    , "乙女心"
    , "假昙花"
    , "吉娃莲"
    , "紫珍珠"
    , "姬玉露"
    , "冬美人"
    , "量天尺"
    , "锦晃星"
    , "蓝石莲"
    , "千佛手"
    , "小球玫瑰"
    , "薄雪万年草"
    , "姬胧月"
    , "筒叶花月"
    , "条纹十二卷"
    , "五十铃玉"
    , "绯花玉"
    , "大和锦"
    , "玉吊钟"
    , "虹之玉锦"
    , "子宝"
    , "金边龙舌兰"
    , "姬秋丽"
    , "玉翁"
    , "月兔耳"
    , "金虎仙人球"
    , "龙骨柱"
    , "茜之塔"
    , "山影拳"
    , "特玉莲"
    , "霜之朝"
    , "短叶虎尾兰"
    , "爱之蔓"
    , "仙人柱"
    , "乌羽玉"
    , "青星美人"
    , "红稚莲"
    , "球松"
    , "枝干番杏"
    , "马齿苋树"
    , "小人祭"
    , "金钱木"
    , "雷童"
    , "莲花掌"
    , "秋丽"
    , "丽娜莲"
    , "多肉观音莲"
    , "若歌诗"
    , "铭月"
    , "露娜莲"
    , "芙蓉雪莲"
    , "鸾凤玉"
    , "清盛锦"
    , "草玉露"
    , "白雪姬"
    , "蛛丝卷绢"
    , "玉龙观音"
    , "绯牡丹"
    , "红稚儿"
    , "新玉缀"
    , "姬红小松"
    , "唐印"
    , "白凤菊"
    , "千代田之松"
    , "白花小松"
    , "三角琉璃莲"
    , "大叶落地生根"
    , "仙女杯"
    , "若绿"
    , "凝脂莲"
    , "黄花照波"
    , "鲁氏石莲花"
    , "初恋"
    , "天狗之舞"
    , "玉米石"
    , "魔南景天"
    , "春之奇迹"
    , "吹雪之松锦"
    , "子孙球"
    , "紫弦月"
    , "叶仙人掌"
    , "黄金花月"
    , "四海波"
    , "赤鬼城"
    , "凝脂菊"
    , "静夜"
    , "红缘莲花掌"
    , "绒针"
    , "月宫殿"
    , "红粉台阁"
    , "中华芦荟"
    , "鼠尾掌"
    , "翡翠景天"
    , "布纹球"
    , "高砂之翁"
    , "伽蓝菜"
    , "福娘"
    , "星王子"
    , "小和锦"
    , "星乙女"
    , "千兔耳"
    , "小红衣"
    , "白牡丹"
    , "熊童子白锦"
    , "帝冠"
    , "爱染锦"
    , "雪莲"
    , "快刀乱麻"
    , "樱水晶"
    , "美丽莲"
    , "毛海星"
    , "黄毛掌"
    , "宝绿"
    , "黑王子"
    , "眩美玉"
    , "芳香波"
    , "神想曲"
    , "观音莲"
    , "琉璃殿"
    , "京之华锦"
    , "金晃"
    , "碧玉莲"
    , "黑兔耳"
    , "白凤"
    , " 英冠玉"
    , "小玉"
    , "方鳞绿塔"
    , "雨心"
    , "紫蛮刀"
    , "十字星锦"
    , "兰黛莲"
    , "条纹蛇尾兰"
    , "锦上珠"
    , "白斑玉露"
    , "蝉翼玉露"
    , "大型玉露"
    , "樱麒麟"
    , "花叶寒月夜"
    , "毛叶莲花掌"
    , "朱莲"
    , "红辉艳"
    , "九轮塔"
    , "花月夜"
    , "梨果仙人掌"
    , "松霞"
    , "圆头玉露"
    , "龙须海棠"
    , "胧月"
    , "泥鳅掌"
    , "黑法师原始种"
    , "红彩阁"
    , "黄金钮"
    , "大卫"
    , "塔松"
    , "神童"
    , "青凤凰"
    , "翁柱"
    , "蓝松"
    , "紫牡丹"
    , "明镜"
    , "银星"
    , "瓦松"
    , "金纽仙人鞭"
    , "黄雪光"
    , "彩云球"
    , "白龙球"
    , "四裂红景天"
    , "草芦荟"
    , "旋风麒麟"
    , "仙人镜"
    , "玉牛掌"
    , "中斑莲花掌"
    , "灿烂缀化"
    , "大叶莲花掌"
    , "半岛玉"
    , "奔龙"
    , "千羽鹤"
    , "龙鳞"
    , "卧牛"
    , "玛瑙殿"
];//多肉植物
var leaf_plants=[
    "一品红"  ,
    "发财树"  ,
    "绿萝"  ,
    "吊兰"  ,
    "滴水观音"  ,
    "富贵竹"  ,
    "文竹"  ,
    "芦荟"  ,
    "常春藤"  ,
    "红掌"  ,
    "米兰"  ,
    "万年青"  ,
    "龟背竹"  ,
    "三角梅"  ,
    "合欢"  ,
    "白掌"  ,
    "一叶兰"  ,
    "豆瓣绿"  ,
    "黄杨"  ,
    "石楠"  ,
    "鹅掌柴"  ,
    "王莲"  ,
    "袖珍椰子"  ,
    "散尾葵"  ,
    "燕子掌"  ,
    "铁树"  ,
    "橡皮树"  ,
    "铁线蕨"  ,
    "棕榈"  ,
    "海桐"  ,
    "紫叶李"  ,
    "南天竹"  ,
    "金叶女贞"  ,
    "八角金盘"  ,
    "水葫芦"  ,
    "龙柏"  ,
    "虎尾兰"  ,
    "孔雀竹芋"  ,
    "水竹"  ,
    "七叶树"  ,
    "虎耳草"  ,
    "鹅掌楸"  ,
    "吊竹梅"  ,
    "黄连木"  ,
    "元宝枫"  ,
    "紫叶小檗"  ,
    "枫香"  ,
    "千屈菜"  ,
    "火炬树"  ,
    "水葱"  ,
    "红花檵木"  ,
    "大花君子兰"  ,
    "酒瓶兰"  ,
    "变叶木"  ,
    "朱蕉"  ,
    "南洋杉"  ,
    "垂叶榕"  ,
    "金边龙舌兰 "  ,
    "青枫"  ,
    "冷水花"  ,
    "香龙血树"  ,
    "五叶地锦"  ,
    "红背桂"  ,
    "假连翘"  ,
    "鱼尾葵"  ,
    "天鹅绒竹芋"  ,
    "花叶芋"  ,
    "阔叶十大功劳" ,
    "桃叶珊瑚"  ,
    "羽衣甘蓝"  ,
    "鹿角蕨"  ,
    "萍蓬草"  ,
    "鸭跖草"  ,
    "彩叶草"  ,
    "姬凤梨"  ,
    "红桑"  ,
    "鹅掌藤"  ,
    "花叶万年青" ,
    "水塔花"  ,
    "白网纹草"  ,
    "广东万年青"  ,
    "花叶艳山姜"  ,
    "文殊兰"  ,
    "孔雀木"  ,
    "五色苋"  ,
    "紫鹅绒"  ,
    "圆叶福禄桐"  ,
    "异叶南洋杉"  ,
    "红背竹芋"  ,
    "皱叶椒草"  ,
    "印度橡皮树"  ,
    "铁十字秋海棠" ,
    "喜阴花"  ,
    "白粉藤"  ,
    "蟆叶秋海棠 "  ,
    "美叶光萼荷" ,
    "黄脉爵床"  ,
    "俏黄栌"  ,
    "彩叶凤梨"  ,
    "大王黛粉叶"  ,
    "花叶木薯"  ,
    "金脉单药花"  ,
    "美叶凤尾蕉"  ,
    "星点秋海棠"  ,
    "西瓜皮椒 "
];//观叶植物
var flower_plants=[	"风信子"         ,
    "紫罗兰"         ,
    "梅花"           ,
    "茉莉花"         ,
    "栀子花"         ,
    "桃花"          ,
    "桔梗"          ,
    "桂花"          ,
    "杜鹃花"        ,
    "月季"          ,
    "曼陀罗"        ,
    "迷迭香"        ,
    "马蹄莲"        ,
    "康乃馨"        ,
    "山茶花"        ,
    "长寿花"        ,
    "迎春花"        ,
    "鸡蛋花"        ,
    "含笑"          ,
    "睡莲"          ,
    "米兰花"        ,
    "牡丹"          ,
    "向日葵"        ,
    "菊花"          ,
    "六月雪"        ,
    "虎刺梅"        ,
    "郁金香"        ,
    "羊蹄甲"        ,
    "金花茶"        ,
    "一品红"        ,
    "荷花 "         ,
    "仙人指"        ,
    "紫薇花"        ,
    "木芙蓉"        ,
    "鹿角海棠"       ,
    "石榴花"        ,
    "水仙"          ,
    "荷兰菊"        ,
    "铁兰"        ,
    "石蒜"        ,
    "荷包花"        ,
    "红花羊蹄甲"    ,
    "蜡梅"          ,
    "花烟草"        ,
    "东京樱花"      ,
    "鹤望兰"        ,
    "大花蕙兰"      ,
    "番红花"        ,
    "百合"          ,
    "勿忘我"        ,
    "君子兰"        ,
    "金银花"        ,
    "兰花"        ,
    "罂粟花"        ,
    "玫瑰"        ,
    "蝴蝶兰"        ,
    "彼岸花"        ,
    "藏红花"        ,
    "三色堇"        ,
    "红掌"        ,
    "昙花"        ,
    "紫藤"        ,
    "木兰花"        ,
    "葛根"        ,
    "美女樱"        ,
    "苹婆"        ,
    "矢车菊"        ,
    "木棉"        ,
    "仙客来"        ,
    "含羞草"        ,
    "蟹爪兰"        ,
    "紫荆"        ,
    "木槿"        ,
    "蔷薇花"        ,
    "夹竹桃"        ,
    "玉兰"        ,
    "合欢"        ,
    "天竺葵"        ,
    "白掌  "        ,
    "绣球花"        ,
    "蓝花楹"        ,
    "油菜花"        ,
    "建兰"        ,
    "鑼艰捒"        ,
    "虞美人"        ,
    "铃兰"        ,
    "藿香"        ,
    "春兰"        ,
    "蓟"        ,
    "九里香"        ,
    "半枝莲"        ,
    "扶桑"        ,
    "梨花"        ,
    "紫花地丁"      ,
    "凌霄"        ,
    "萱草"        ,
    "垂丝海棠"      ,
    "西府海棠"      ,
    "蕙兰"        ,
    "地黄"        ,
    "榆叶梅"        ,
    "金盏花"        ,
    "美人蕉"        ,
    "月见草"        ,
    "铁线莲"        ,
    "沙漠玫瑰"      ,
    "令箭荷花"       ,
    "雏菊"        ,
    "桃金娘"        ,
    "金樱子"        ,
    "长春花"        ,
    "红瑞木"        ,
    "刺儿菜"        ,
    "西番莲"        ,
    "八仙花"        ,
    "蝴蝶花"        ,
    "白芨"        ,
    "杏花"        ,
    "刺槐"        ,
    "贴梗海棠"      ,
    "接骨木"        ,
    "飞燕草"        ,
    "炮仗花"        ,
    "含笑花"        ,
    "紫玉兰"        ,
    "珍珠梅"        ,
    "棣棠"        ,
    "丽格海棠"      ,
    "佛甲草"        ,
    "倒挂金钟"      ,
    "玉簪花"        ,
    "芍药"        ,
    "金银木"        ,
    "石楠花"        ,
    "黄刺玫"        ,
    "凤凰木"        ,
    "球兰"        ,
    "金缕梅"        ,
    "日本晚樱"      ,
    "莪术"        ,
    "金边瑞香"      ,
    "十大功劳"      ,
    "茶梅"        ,
    "刺桐"        ,
    "毛地黄"        ,
    "假昙花"        ,
    "报春花"        ,
    "垂笑君子兰"    ,
    "文冠果"        ,
    "五爪金龙"      ,
    "禾雀花"        ,
    "鸳鸯茉莉"      ,
    "凤尾兰"        ,
    "火炬树"        ,
    "福禄考"        ,
    "石竹"        ,
    "梓树"        ,
    "锦带花"        ,
    "小檗"        ,
    "红花檵木"      ,
    "红千层"        ,
    "火焰木"        ,
    "络石"        ,
    "龙船花"        ,
    "金丝桃"        ,
    "花毛茛"        ,
    "五色梅"        ,
    "金鸡菊"        ,
    "结香"        ,
    "牵牛"        ,
    "六倍利"        ,
    "琉璃苣"        ,
    "蓝雪花"        ,
    "洛神花"        ,
    "接骨草"        ,
    "龙吐珠"        ,
    "吊钟花"        ,
    "凤仙花"        ,
    "金鱼草"        ,
    "姜花"        ,
    "鸡冠刺桐"      ,
    "黄花风铃木"    ,
    "使君子"        ,
    "朱顶红"        ,
    "黄槐"        ,
    "木荷"        ,
    "梭鱼草"        ,
    "金钟花"        ,
    "猫尾草"        ,
    "稠李"        ,
    "琴叶珊瑚"      ,
    "野牡丹"        ,
    "凤眼莲"        ,
    "天人菊"        ,
    "郁李"        ,
    "百子莲"        ,
    "巴西鸢尾"      ,
    "叶子花"        ,
    "白晶菊"        ,
    "水鬼蕉"        ,
    "大丽花"        ,
    "假连翘"        ,
    "德国鸢尾"      ,
    "串钱柳"        ,
    "醉鱼草"        ,
    "毛鹃"        ,
    "夏堇"        ,
    "锦鸡儿"        ,
    "非洲凤仙"      ,
    "红蓼"        ,
    "孔雀草"        ,
    "蓝目菊"        ,
    "黑心菊"        ,
    "狗牙花"        ,
    "荷花玉兰"      ,
    "假苹婆"        ,
    "活血丹"        ,
    "射干"        ,
    "非洲菊"        ,
    "矮牵牛"        ,
    "头花蓼"        ,
    "尖叶杜英"      ,
    "金凤花"        ,
    "蓝花鼠尾草"    ,
    "夜合花"        ,
    "蕺菜"        ,
    "云实"       ,
    "甘菊"        ,
    "黄槿"        ,
    "半支莲"        ,
    "月光花"        ,
    "飘香藤"        ,
    "红花醡浆草"    ,
    "紫娇花"        ,
    "金焰绣线菊"    ,
    "帝王花"        ,
    "大花金鸡菊"    ,
    "四季秋海棠"    ,
    "费菜"        ,
    "鸡矢藤"        ,
    "万寿菊"        ,
    "藿香蓟"        ,
    "美丽月见草"    ,
    "大花紫薇"      ,
    "水石榕"        ,
    "黄蝉"        ,
    "羽叶薰衣草"    ,
    "金盏菊"        ,
    "金光菊"        ,
    "檵木"        ,
    "万代兰"        ,
    "点地梅"        ,
    "臭牡丹"        ,
    "大花六道木"    ,
    "白车轴草"      ,
    "麦李"        ,
    "葱兰"        ,
    "麻叶绣线菊"    ,
    "硫华菊"        ,
    "一串红"        ,
    "蜀葵"        ,
    "蜡菊"        ,
    "香水草"        ,
    "麝香百合"      ,
    "百日草"        ,
    "贝壳花"        ,
    "松红梅"        ,
    "萍蓬草"        ,
    "美国薄荷"      ,
    "阿拉伯婆婆纳"  ,
    "鸡冠花"        ,
    "火绒草"        ,
    "花毛莨"        ,
    "四海波"        ,
    "大花马齿苋"    ,
    "千日红"        ,
    "荷包牡丹"      ,
    "时钟花"        ,
    "大滨菊"        ,
    "海仙花"        ,
    "悬铃花"        ,
    "旱金莲"        ,
    "海石竹"        ,
    "金苞花"        ,
    "紫萼"        ,
    "石仙桃"        ,
    "假酸浆"        ,
    "午时花"        ,
    "钓钟柳"        ,
    "萼距花"        ,
    "软枝黄蝉"      ,
    "大花葱"        ,
    "粉花绣线菊"    ,
    "灰莉"        ,
    "猬实"         ,
    "彩色蹄莲"      ,
    "蔓花生"        ,
    "风铃草"        ,
    "新几亚凤仙"    ,
    "黄兰"         ,
    "锦绣鹃"        ,
    "洋桔梗"        ,
    "串叶香草"      ,
    "银合欢"        ,
    "蒜香藤"        ,
    "珊瑚藤"        ,
    "瓜叶菊"        ,
    "海州山"        ,
    "白三草"        ,
    "韩信草"        ,
    "松叶菊"        ,
    "球花斛"        ,
    "金露梅"        ,
    "茑萝"         ,
    "金铃花"        ,
    "卷丹合"        ,
    "杠柳"         ,
    "黄花尾"        ,
    "兜唇斛"        ,
    "金丝梅"        ,
    "芙蓉菊"        ,
    "小冠花"        ,
    "鬼罂粟"        ,
    "大岩桐"        ,
    "大花人蕉"      ,
    "芙蓉葵"        ,
    "黄花竹桃"      ,
    "海芒果"        ,
    "白睡莲"        ,
    "山丹花"        ,
    "花菱草"        ,
    "香雪球"        ,
    "湖北棠"        ,
    "繁星花"        ,
    "唐菖蒲"        ,
    "翠雀"         ,
    "风兰"         ,
    "小苍兰"        ,
    "矮雪轮"        ,
    "假龙花"        ,
    "瞿麦"         ,
    "黄水仙"        ,
    "凤丹"         ,
    "红花桦"        ,
    "翅荚明"        ,
    "文殊兰"       ,
    "山指甲"       ,
    "非洲罗兰"     ,
    "韭莲"        ,
    "翠菊"        ,
    "羽扇豆"       ,
    "韭兰"        ,
    "松果菊"       ,
    "红丁香"       ,
    "锦葵"        ,
    "勋章菊"       ,
    "肥皂草"       ,
    "地涌莲"       ,
    "文心兰"       ,
    "角蒿"        ,
    "大花草"       ,
    "马利筋"       ,
    "华北珠梅"     ,
    "黄堇"        ,
    "卡特兰"       ,
    "光叶花"       ,
    "火烧花"       ,
    "还亮草"       ,
    "风毛菊"       ,
    "华北斗菜"     ,
    "花木蓝"       ,
    "红蕉"        ,
    "葱莲"        ,
    "二乔兰"       ,
    "狗娃花"       ,
    "狗舌草"       ,
    "黄槐明"       ,
    "多花藤"       ,
    "剪秋罗"       ,
    "荷兰花"       ,
    "红花鸡儿"     ,
    "红鸡花"       ,
    "火焰兰"       ,
    "垂枝千层"     ,
    "冬红"        ,
    "吊灯桑"       ,
    "白花竹桃"     ,
    "闭鞘姜"       ,
    "多花牡丹"     ,
    "鹅掌草"       ,
    "红睡莲"       ,
    "红花胆"       ,
    "碧玉兰"       ,
    "大花灵仙"     ,
    "粉花见草"     ,
    "侧金花"       ,
    "红花殊兰"     ,
    "带叶兰"       ,
    "粉苞脚杆"     ,
    "大白鹃"       ,
    "滇山茶"       ,
    "单瓣刺玫"     ,
    "瓣蕊松草"     ,
    "黑心光菊"     ,
    "东北合"       ,
    "多被莲花"     ,
    "红花斛"       ,
    "独占春"       ,
    "黄钟木"       ,
    "北黄菜"       ,
    "短毛活"       ,
    "半钟线莲"     ,
    "多叶扇豆"     ,
    "白马莲"       ,
    "海杧果"       ,
    "斑叶菜"       ,
    "爆仗竹"       ,
    "齿缘吊钟花"   ,
    "厚萼凌霄"     ,
    "粉紫重瓣木槿" ,
    "非洲凌霄属"   ,
    "广布红门兰"   ,
    "多花指甲兰"   ,
    "达乌里秦艽"   ,
    "达乌里黄耆"   ,
    "垂枝大叶早樱" ,
    "大花蓝盆花"   ,
    "橙红茑萝"     ,
    "桉叶藤"       ,
    "东野菰"       ,
    "黄绿贝母兰"   ,
    "碧冬茄属"     ];

var herb_palnts=[	"风信子"  ,
    "紫罗兰"  ,
    "长寿花"  ,
    "牡丹"  ,
    "向日葵"  ,
    "菊花"  ,
    "郁金香"  ,
    "荷花"  ,
    "水仙"  ,
    "石蒜"  ,
    "鹤望兰"  ,
    "大花蕙兰"  ,
    "番红花"  ,
    "绿巨人"  ,
    "吊兰"  ,
    "勿忘我"  ,
    "滴水观音"  ,
    "君子兰"  ,
    "文竹"  ,
    "蝴蝶兰"  ,
    "丹参"  ,
    "肉苁蓉"  ,
    "三色堇"  ,
    "红掌"  ,
    "龟背竹"  ,
    "白花蛇舌草"  ,
    "仙客来"  ,
    "锁阳"  ,
    "天竺葵"  ,
    "白掌"  ,
    "金心吊兰"  ,
    "豆瓣绿"  ,
    "虞美人"  ,
    "野草莓"  ,
    "雪绒花"  ,
    "地黄"  ,
    "珍珠吊兰"  ,
    "金边吊兰"  ,
    "黑麦草"  ,
    "紫花苜蓿"  ,
    "土茯苓"  ,
    "黑王子"  ,
    "银皇后"  ,
    "雏菊"  ,
    "七叶一枝花"  ,
    "桃美人"  ,
    "苁蓉"  ,
    "紫珍珠"  ,
    "翻白草"  ,
    "虎尾兰"  ,
    "玉簪花"  ,
    "芍药"  ,
    "孔雀竹芋"  ,
    "蔊菜"  ,
    "马尼拉草"  ,
    "浙贝母"  ,
    "猪笼草"  ,
    "香雪兰"  ,
    "石竹"  ,
    "景天三七"  ,
    "牵牛"  ,
    "地榆"  ,
    "瓦松"  ,
    "芦苇"  ,
    "虎眼万年青"  ,
    "草豆蔻"  ,
    "洛神花"  ,
    "凤仙花"  ,
    "镜面草"  ,
    "金娃娃萱草"  ,
    "黑天天"  ,
    "金鱼草"  ,
    "波斯菊"  ,
    "宽叶吊兰"  ,
    "朱顶红"  ,
    "白英"  ,
    "猪殃殃"  ,
    "一枝黄花"  ,
    "猫尾草"  ,
    "捕蝇草"  ,
    "对兰"  ,
    "金针"  ,
    "芭蕉"  ,
    "水鬼蕉"  ,
    "大丽花"  ,
    "独脚金"  ,
    "葡萄风信子"  ,
    "白茅"  ,
    "红蓼"  ,
    "孔雀草"  ,
    "空心莲子草"  ,
    "连钱草"  ,
    "苦地丁"  ,
    "一年蓬"  ,
    "射干"  ,
    "缬草"  ,
    "非洲菊"  ,
    "蟛蜞菊"  ,
    "矮牵牛"  ,
    "星星草"  ,
    "蕺菜"  ,
    "紫茉莉"  ,
    "竹节草"  ,
    "万寿菊"  ,
    "玉龙草"  ,
    "羽衣甘蓝"  ,
    "百蕊草"  ,
    "花叶玉簪"  ,
    "胡黄连"  ,
    "金盏菊"  ,
    "堇菜"  ,
    "草石蚕"  ,
    "紫云英"  ,
    "琉璃殿"  ,
    "银边吊兰"  ,
    "崩大碗"  ,
    "葱兰"  ,
    "一串红"  ,
    "蜀葵"  ,
    "百日草"  ,
    "鸡冠花"  ,
    "假俭草"  ,
    "千日红"  ,
    "鸭跖草"  ,
    "荷包牡丹"  ,
    "旱金莲"  ,
    "博落回"  ,
    "假酸浆"  ,
    "新疆阿魏"  ,
    "风铃草"  ,
    "洋桔梗"  ,
    "牛舌草"  ,
    "彩叶草"  ,
    "一叶草"  ,
    "金钗石斛"  ,
    "瓜叶菊"  ,
    "草地早熟禾"  ,
    "菥蓂"  ,
    "聚合草"  ,
    "延龄草"  ,
    "翠云草"  ,
    "花叶万年青"  ,
    "茑萝"  ,
    "鬼罂粟"  ,
    "狗尾草"  ,
    "大岩桐"  ,
    "吉祥草"  ,
    "杜若"  ,
    "列当"  ,
    "袋鼠花"  ,
    "观赏辣椒"  ,
    "绵枣儿"  ,
    "五节芒"  ,
    "香雪球"  ,
    "花菱草"  ,
    "广东万年青"  ,
    "唐菖蒲"  ,
    "吊金钱"  ,
    "小苍兰"  ,
    "细叶结缕草"  ,
    "席草"  ,
    "瞿麦"  ,
    "牛毛毡"  ,
    "文殊兰"  ,
    "非洲紫罗兰"  ,
    "亚洲百合"  ,
    "醉蝶花"  ,
    "银心吊兰"  ,
    "翠菊"  ,
    "羽扇豆"  ,
    "韭兰"  ,
    "五色苋"  ,
    "地肤"  ,
    "松果菊"  ,
    "留兰香"  ,
    "木犀草"  ,
    "蒲苇"   ,
    "斑马芦荟"   ,
    "锦葵"   ,
    "勋章菊"   ,
    "地涌金莲"   ,
    "兜兰"   ,
    "文心兰"   ,
    "大花萱草"   ,
    "峨眉雪胆"   ,
    "紫叶酢浆草"   ,
    "黄堇"   ,
    "车轴草"   ,
    "窃衣"   ,
    "卡特兰"   ,
    "大花犀角"   ,
    "羊胡子草"   ,
    "大叶子"   ,
    "柱花草"   ,
    "大黄花"   ,
    "水田芥"   ,
    "阴行草"   ,
    "蕉藕"   ,
    "寄生藤"   ,
    "王妃雷神"   ,
    "鳞托菊"   ,
    "珊瑚菜"   ,
    "水薄荷"   ,
    "小香蒲"   ,
    "米面翁"   ,
    "粉蝶花"   ,
    "黑草"   ,
    "蛇菰"   ,
    "水蕹"   ,
    "红花烟草"   ,
    "光慈姑"   ,
    "虎掌草"   ,
    "日本血草"   ,
    "万年麻"   ,
    "大花剪秋罗"   ,
    "水毛花"   ,
    "糖芥"   ,
    "灯笼泡"   ,
    "还阳参"   ,
    "山芥菜"   ,
    "隔山香"   ,
    "紫瓶子草"   ,
    "水柏枝"   ,
    "粘毛卷耳"   ,
    "小丛红景天"   ,
    "茅瓜"   ,
    "兔儿菜"   ,
    "蛇根草"   ,
    "小花鸢尾"   ,
    "钝叶草"   ,
    "苦马豆"   ,
    "美丽飞蓬"   ,
    "银脉爵床"   ,
    "香车叶草"   ,
    "卜若地"   ,
    "大花夏枯草"   ,
    "艳红鹿子百合" ,
    "石碱草"   ,
    "大油芒"   ,
    "瓣蕊唐松草"   ,
    "金发草"   ,
    "笋兰"   ,
    "石油菜"   ,
    "牛尾草"   ,
    "圆叶茅膏菜"   ,
    "绒叶肖竹芋"   ,
    "盒子草"   ,
    "花叶如意"   ,
    "匍枝毛茛"   ,
    "宽叶雀稗"   ,
    "狭叶红景天"   ,
    "小露兜"   ,
    "石上藕"   ,
    "长鞭红景天"   ,
    "三色竹芋"   ,
    "直立百部"   ,
    "流苏贝母兰"   ,
    "糖蜜草"   ,
    "紫苞鸢尾"   ,
    "细叶沿阶草"   ,
    "繁穗苋"   ,
    "柠檬留兰香"   ,
    "华丽龙胆"   ,
    "三毛草"   ,
    "鸢尾蒜"   ,
    "岩菖蒲"   ,
    "旋蒴苣苔"   ,
    "金叶兰"   ,
    "红花除虫菊"   ,
    "大花麦瓶草"   ,
    "丛生风铃草"   ,
    "菊蒿"   ,
    "沙生冰草  "   ,
    "管花马兜铃"   ,
    "蒙特登慈菇"   ,
    "大花鸡肉参"   ,
    "匙叶茅膏菜"   ,
    "巢凤梨"   ,
    "杂种勋章菊"   ,
    "皱叶剪夏罗"   ,
    "白毛羊胡子草" ,
    "大花皇冠"   ,
    "串叶草"   ,
    "腋花苋"   ,
    "大花线柱兰"   ,
    "阿尔泰菊蒿"   ,
    "东野菰"   ,
    "野亚麻"   ,
    "丁座草"   ,
    "爪哇白豆蔻"   ,
    "黑水亚麻  "   ,
    "扁茎灯心草"   ,
    "蔓金腰"   ,
    "红花茜草"   ];

var xylophyta_plants=[	"梅花"  ,
    "茉莉花"  ,
    "栀子花"  ,
    "桃花"  ,
    "桂花"  ,
    "杜鹃花"  ,
    "月季"  ,
    "迷迭香"  ,
    "山茶花"  ,
    "迎春花"  ,
    "鸡蛋花"  ,
    "含笑"  ,
    "米兰花"  ,
    "牡丹"  ,
    "羊蹄甲"  ,
    "金花茶"  ,
    "紫薇花"  ,
    "蜡梅"  ,
    "发财树"  ,
    "玫瑰"  ,
    "紫藤"  ,
    "苹婆"  ,
    "木棉"  ,
    "紫荆"  ,
    "木槿"  ,
    "夹竹桃"  ,
    "玉兰"  ,
    "合欢"  ,
    "黄杨"  ,
    "石楠"  ,
    "袖珍椰子"  ,
    "散尾葵"  ,
    "九里香"  ,
    "扶桑"  ,
    "凌霄"  ,
    "垂丝海棠"  ,
    "西府海棠"  ,
    "橡皮树"  ,
    "棕榈"  ,
    "榆叶梅" ,
    "凤尾竹"  ,
    "海桐"  ,
    "铁线莲"  ,
    "沙漠玫瑰"  ,
    "桃金娘"  ,
    "棕竹"  ,
    "紫玉兰"  ,
    "板栗树"  ,
    "马尾松"  ,
    "海棠"  ,
    "爬山虎"  ,
    "琼花"  ,
    "广玉兰"  ,
    "夜来香"  ,
    "梨树"  ,
    "栾树"  ,
    "胖大海树"  ,
    "苦丁茶"  ,
    "蛋黄果"  ,
    "云杉"  ,
    "面包树"  ,
    "连翘"  ,
    "香椿"  ,
    "红叶石楠"  ,
    "水杉"  ,
    "龙眼树"  ,
    "碧桃"  ,
    "蔷薇"  ,
    "柠檬"  ,
    "槟榔"  ,
    "白蜡树"  ,
    "樟树 "  ,
    "佛手"  ,
    "榉树"  ,
    "罗汉松"  ,
    "芭乐"  ,
    "火棘"  ,
    "榆树"  ,
    "山莓"  ,
    "柚子树"  ,
    "梧桐"  ,
    "银杏"  ,
    "神秘果"  ,
    "秋海棠花"  ,
    "椰子树"  ,
    "荔枝树"  ,
    "人心果"  ,
    "桑树"  ,
    "菩提树"  ,
    "山楂树"  ,
    "石栎"  ,
    "苎麻"  ,
    "无花果树"  ,
    "杏树"  ,
    "鸡血藤"  ,
    "杉木"  ,
    "藤本月季"  ,
    "丁香"  ,
    "无患子"  ,
    "榕树"  ,
    "苦参"  ,
    "雪松"  ,
    "杜仲"  ,
    "桉树"  ,
    "红枫"  ,
    "油茶树"  ,
    "樱花"  ,
    "槐树"
];

var aquatic_plants=["风信子"   ,
    "马蹄莲"   ,
    "睡莲"   ,
    "荷花"   ,
    "水仙"   ,
    "鱼腥草"   ,
    "芡实"   ,
    "鸢尾"   ,
    "满江红"   ,
    "碗莲"   ,
    "香蒲"   ,
    "王莲"   ,
    "菖蒲"   ,
    "泽泻"   ,
    "美人蕉"   ,
    "半边莲"   ,
    "蝴蝶花"   ,
    "浮萍"   ,
    "水葫芦"   ,
    "石菖蒲"   ,
    "茨菰"   ,
    "金鱼藻"   ,
    "水竹"   ,
    "千屈菜"   ,
    "苹"   ,
    "慈菇"   ,
    "水葱"   ,
    "灯心草"   ,
    "慈姑"   ,
    "蕹菜"   ,
    "水芹"   ,
    "芦苇"   ,
    "再力花"   ,
    "荇菜"   ,
    "姜花"   ,
    "苦草"   ,
    "梭鱼草"   ,
    "黑藻"   ,
    "菰"   ,
    "黄菖蒲"   ,
    "芦竹"   ,
    "凤眼莲"   ,
    "皇冠草"   ,
    "狐尾藻"   ,
    "鸭舌草"   ,
    "花叶芦竹"   ,
    "红菱"   ,
    "狸藻"   ,
    "菹草"   ,
    "问荆"   ,
    "花菖蒲"   ,
    "萍蓬草"   ,
    "水鳖"   ,
    "水菖蒲"   ,
    "玉带草"   ,
    "纸莎草"   ,
    "大薸"   ,
    "三白草"   ,
    "三棱草"   ,
    "白睡莲"   ,
    "紫芋"   ,
    "布袋莲"   ,
    "野慈姑"   ,
    "蒲苇 "   ,
    "水烛"   ,
    "海菜花"   ,
    "玉蝉花"   ,
    "水罂粟"   ,
    "莕菜"   ,
    "藨草"   ,
    "金钱蒲"   ,
    "大萍"   ,
    "黄花水龙"   ,
    "过塘蛇"   ,
    "睡菜"   ,
    "水竹叶"   ,
    "马来眼子菜"   ,
    "紫萍"   ,
    "花叶芦苇"   ,
    "水丁香"   ,
    "水蕹"   ,
    "黄花狸藻"   ,
    "野荸荠"   ,
    "红莲子草"   ,
    "水车前"   ,
    "黑三棱"   ,
    "花叶水葱"   ,
    "花蔺"   ,
    "红睡莲"   ,
    "花叶香蒲"   ,
    "水禾"   ,
    "野菱"   ,
    "沼生水马齿"   ,
    "水盾草"   ,
    "两栖蓼"   ,
    "亚马逊王莲"   ,
    "金银莲花"   ,
    "茶菱"   ,
    "槐叶苹"   ,
    "浮叶眼子菜"   ,
    "柔毛齿叶睡莲"   ,
    "光叶眼子菜"   ,
    "金棒花"   ,
    "小浮莲"   ,
    "三棱水葱"   ,
    "窄叶泽泻"   ,
    "菱叶水龙"   ,
    "靖西海菜花"   ];

var house_plants=[	"风信子"    ,
    "紫罗兰"    ,
    "长寿花"    ,
    "一品红"    ,
    "白雪公主"    ,
    "发财树"    ,
    "绿萝"    ,
    "绿巨人"    ,
    "吊兰"    ,
    "勿忘我"    ,
    "薰衣草"    ,
    "滴水观音"    ,
    "君子兰"    ,
    "薄荷"    ,
    "文竹"    ,
    "杜鹃"    ,
    "红豆杉"    ,
    "蝴蝶兰"    ,
    "芦荟"    ,
    "常春藤"    ,
    "三色堇"    ,
    "红掌"    ,
    "万年青"    ,
    "驱蚊草"    ,
    "龟背竹"    ,
    "仙人球"    ,
    "铜钱草"    ,
    "仙客来"    ,
    "青苹果"    ,
    "蟹爪兰"    ,
    "虎皮兰"    ,
    "天竺葵"    ,
    "白掌"    ,
    "如意"    ,
    "一叶兰"    ,
    "千手观音"    ,
    "豆瓣绿"    ,
    "碰碰香"    ,
    "金钱树"    ,
    "牵牛花"    ,
    "袖珍椰子"    ,
    "散尾葵"    ,
    "罗勒"    ,
    "非洲茉莉"    ,
    "龙血树"    ,
    "橡皮树"    ,
    "铁线蕨"    ,
    "凤尾竹"    ,
    "春雨"    ,
    "金琥"    ,
    "一帆风顺"    ,
    "绿宝石"    ,
    "银皇后"    ,
    "鼠尾草"    ,
    "长春花"    ,
    "棕竹"    ,
    "千年木"    ,
    "金钻"    ,
    "竹柏"    ,
    "巴西木"    ,
    "元宝树"    ,
    "吸毒草"    ,
    "孔雀竹芋"    ,
    "也门铁"    ,
    "鸟巢蕨"    ,
    "网纹草"    ,
    "量天尺"    ,
    "观音竹"    ,
    "鸭掌木"    ,
    "酒瓶兰"    ,
    "变叶木"    ,
    "黑美人"    ,
    "南洋杉"    ,
    "牛至"    ,
    "扶郎花"    ,
    "百合竹"    ,
    "垂叶榕"    ,
    "合果芋"    ,
    "红运当头"    ,
    "猫眼竹芋"    ,
    "波斯顿蕨"    ,
    "夏威夷椰子"    ,
    "心叶球兰"    ,
    "蓬莱松"    ,
    "巴西美人"    ,
    "萍蓬草"    ,
    "螺纹铁"    ,
    "绿霸王"    ,
    "水晶掌"    ,
    "富贵竹笼"    ,
    "金钱蒲"    ,
    "趣蝶莲"    ,
    "发财王"    ,
    "龙爪叶"    ,
    "舍金榕"    ,
    "袖子椰子"
];

var hydroponic_plants=[	"风信子" ,
    "栀子花" ,
    "马蹄莲" ,
    "长寿花" ,
    "米兰花" ,
    "铁兰" ,
    "鹤望兰" ,
    "发财树" ,
    "绿萝" ,
    "吊兰" ,
    "滴水观音" ,
    "君子兰" ,
    "富贵竹" ,
    "文竹" ,
    "蝴蝶兰" ,
    "芦荟" ,
    "常春藤" ,
    "红掌" ,
    "万年青" ,
    "龟背竹" ,
    "仙人球" ,
    "仙客来" ,
    "天竺葵" ,
    "白掌" ,
    "一叶兰" ,
    "豆瓣绿" ,
    "金钱树" ,
    "袖珍椰子" ,
    "扶桑" ,
    "燕子掌" ,
    "铁树" ,
    "橡皮树" ,
    "美人蕉" ,
    "金琥" ,
    "棕竹" ,
    "八仙花" ,
    "虎尾兰" ,
    "巴西木" ,
    "玉簪花" ,
    "麒麟掌" ,
    "孔雀竹芋" ,
    "水竹" ,
    "虎耳草" ,
    "吊竹梅" ,
    "小叶榕" ,
    "报春花" ,
    "肾蕨" ,
    "条纹十二卷",
    "酒瓶兰" ,
    "朱蕉" ,
    "虎眼万年青",
    "莲花掌" ,
    "镜面草" ,
    "金边龙舌兰",
    "朱顶红" ,
    "冷水花" ,
    "合果芋" ,
    "花叶蔓长春",
    "花叶芋" ,
    "凤尾蕨" ,
    "四季秋海棠",
    "桃叶珊瑚" ,
    "荷兰铁" ,
    "花叶万年青",
    "吉祥草" ,
    "广东万年青",
    "花叶鹅掌柴",
    "皱叶椒草" ,
    "蟆叶秋海棠",
    "彩叶凤梨" ];



var carnivorous_plants=["食虫草",
    "眼镜蛇瓶子草",
    "捕人藤",
    "好望角茅膏菜",
    "二齿猪笼草",
    "锦地罗",
    "苹果猪笼草",
    "小太阳瓶子草",
    "黄花狸藻",
    "勺叶茅膏菜",
    "阿帝露茅膏菜",
    "马来王猪笼草",
    "巨夹捕蝇草",
    "丝叶狸藻",
    "小瓶子草",
    "食人鱼捕蝇草",
    "查尔逊瓶子草",
    "风铃猪笼草",
    "黄花单角胡麻",
    "劳氏猪笼草",
    "黄瓶子草",
    "维奇猪笼草",
    "紫色瓶子草",
    "美人齿捕蝇草",
    "锦地罗茅膏菜",
    "鹦鹉瓶子草",
    "诺斯猪笼草",
    "圆叶茅膏菜",
    "孔雀茅膏菜",
    "马桶猪笼草",
    "月亮湖茅膏菜",
    "莱佛士猪笼草",
    "爱德华猪笼草",
    "露叶毛毡苔",
    "翼状猪笼草",
    "印度猪笼草",
    "白环猪笼草",
    "大叶猪笼草",
    "宝特猪笼草",
    "葫芦猪笼草",
    "疑惑猪笼草",
    "无刺猪笼草",
    "盾叶猪笼草",
    "短梗挖耳草",
    "球根茅膏菜",
    "纯真捕虫堇",
    "朱迪思瓶子草",
    "圆盾猪笼草",
    "白瓶子草",
    "漏斗捕蝇草",
    "宝贝捕蝇草",
    "爱心茅膏菜",
    "布雷密狸藻",
    "北领地茅膏菜",
    "绒毛茅膏菜",
    "真穗猪笼草",
    "南方狸藻",
    "红瓶子草",
    "两眼猪笼草",
    "艾玛猪笼草",
    "垂花太阳瓶草",
    "刚毛猪笼草",
    "贾桂琳猪笼草",
    "盾鳞狸藻",
    "瘦缩布罗基梨",
    "长叶狸藻",
    "克洛斯猪笼草",
    "马兜铃猪笼草",
    "钩唇猪笼草",
    "泉氏猪笼草",
    "土瓶子",
    "螺旋狸藻",
    "叉叶茅膏菜",
    "囊泡貉藻",
    "盾叶茅膏菜",
    "天鹅瓶子草",
    "墨兰捕虫堇",
    "裸瓶猪笼草",
    "胡瑞尔猪笼草",
    "山地瓶子草",
    "双瓣狸藻",
    "杏黄猪笼草",
    "负子毛毡苔",
    "纤细捕虫堇",
    "卓越猪笼草",
    "细长距狸藻",
    "圆叶挖耳草",
    "斜果挖耳草",
    "蔷薇瓶子草",
    "紫花螺旋狸藻",
    "无毛猪笼草",
    "双鳞片狸藻",
    "细长捕虫堇",
    "南极洲捕虫堇",
    "陈氏猪笼草 ",
    "布朗歇狸藻 ",
    "细叶狸藻",
    "叉蕊毛毡苔",
    "巨大捕虫堇",
    "斯迈尔斯猪草",
    "劳氏捕虫堇",
    "凹瓣捕虫堇",
    "角状狸藻",
    "汉米尔顿毛苔",
    "湿地狸藻",
    "匙叶猪笼草",
    "苏门答腊猪草",
    "贝里猪笼草",
    "金花狸藻",
    "曼西毛毡苔",
    "丝状螺旋狸藻",
    "海南挖耳草",
    "山寨樱叶",
    "双形狸藻",
    "宽叶猪笼草",
    "双裂苞狸藻",
    "杏黄狸藻",
    "贝尔特罗嘉梨",
    "丝叶捕虫堇",
    "鞍型猪笼草",
    "辛布亚猪笼草",
    "翼状瓶子草",
    "撒迦捕虫堇",
    "波哥猪笼草",
    "马达加斯加苔",
    "小肾叶狸藻",
    "豹斑猪笼草",
    "少花狸藻",
    "长柄茅膏菜",
    "滴液猪笼草",
    "软叶狸藻",
    "粗毛猪笼草",
    "矮螺旋狸藻",
    "非洲螺旋狸藻",
    "禾叶挖耳草",
    "柯普兰猪笼草",
    "暗色猪笼草",
    "科西嘉捕虫堇"];





var test=["食人鱼捕蝇草"];


var plants  =[];
var index = 0;

var getSucculent_plants = function () {
    var type = "多肉植物";
    plants=succulent_plants;
    upsertFlowers(type);
}

var testPlants=function () {
    var type = "食肉植物";
    plants=test;
    upsertFlowers(type);
}

var getLeaf_plants= function () {
    var type="观叶植物";
    plants=leaf_plants;
    upsertFlowers(type);
}
var getFlower_plants= function () {
    var type="观花植物";
    plants=flower_plants;
    upsertFlowers(type);
}

var getHerb_palnts= function () {
    var type="草本植物";
    plants=herb_palnts;
    upsertFlowers(type);
}

var getXylophyta_plants= function () {
    var type="木本植物";
    plants=xylophyta_plants;
    upsertFlowers(type);
}

var getAquatic_plants= function () {
    var type="水生植物";
    plants=aquatic_plants;
    upsertFlowers(type);
}

getHouse_plants= function () {
    var type="室内植物";
    plants=house_plants;
    upsertFlowers(type);
}
getHydroponic_plants= function () {
    var type="水培植物";
    plants=hydroponic_plants;
    upsertFlowers(type);
}

getCarnivorous_plants= function () {
    var type="食肉植物";
    plants=carnivorous_plants;
    upsertFlowers(type);
}


var upsertFlowers = function (type) {
    console.log("~~~~~~~~~~~~~~");

    console.time("turn" + index);
    var options = {
        hostname: "baike.baidu.com",
        method: "GET",
        port: 80,
        path: encodeURI("/search/word?word=" +plants[index] )
    }
    search.searchFlowers(http, options, function (e, data) {
        if (!e) {
            var $ = cheerio.load(data);
            var title = [];
            var value = [];
            var flower = {
                basic_info: {}
            };

            $('div.basic-info').find('dl').each(function (i, elem) {
                $(this).find('dt').each(function (i, elem) {
                    title.push(utils.removeAllSpace($(this).text()));
                });
                $(this).find('dd').each(function (i, elem) {
                    value.push(utils.removeAllSpace($(this).text()));
                });
            });
            flower.head_from = utils.strWithoutEmpty($('div.summary-pic').find('img').attr('src'), "暂无");
            flower.type = type;
            flower.desc = utils.strWithoutEmpty(utils.removeAllSpace($('div.lemma-summary').text()), "暂无");
            for (var i = 0; i < title.length; i++) {
                if (title[i] == "中文学名") {
                    flower.basic_info.ch_name = {
                        title: title[i],
                        value: value[i]
                    }
                    flower.name = utils.strWithoutEmpty(value[i]);
                } else if (title[i] == "拉丁学名") {
                    flower.basic_info.scientific_name = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "别称") {
                    flower.basic_info.nick_name = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "界") {
                    flower.basic_info.regnumvegetabile = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚界") {
                    flower.basic_info.subkingdom = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "门") {
                    flower.basic_info.divisio = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚门") {
                    flower.basic_info.subdivisio = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "纲") {
                    flower.basic_info.classis = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚纲") {
                    flower.basic_info.subclassis = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "目") {
                    flower.basic_info.ordo = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚目") {
                    flower.basic_info.subordo = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "科") {
                    flower.basic_info.familia = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚科") {
                    flower.basic_info.subfamilia = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "族") {
                    flower.basic_info.tribus = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚族") {
                    flower.basic_info.subtribus = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "属") {
                    flower.basic_info.genus = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚属") {
                    flower.basic_info.subgenus = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "组") {
                    flower.basic_info.sectio = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚组") {
                    flower.basic_info.subsectio = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "系") {
                    flower.basic_info.series = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚系") {
                    flower.basic_info.subseries = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "种") {
                    flower.basic_info.species = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "亚种") {
                    flower.basic_info.subspecies = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "变种") {
                    flower.basic_info.varietas = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "变型") {
                    flower.basic_info.forma = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "分布区域") {
                    flower.basic_info.area = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "环境分布") {
                    flower.basic_info.enviroment = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "生态习性") {
                    flower.basic_info.ecological_habit = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "生活型") {
                    flower.basic_info.life_form = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "日照") {
                    flower.basic_info.illumination = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "水分") {
                    flower.basic_info.moisture = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "温度") {
                    flower.basic_info.temperature = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "土壤") {
                    flower.basic_info.soil = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "海拔") {
                    flower.basic_info.altitude = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "花期") {
                    flower.basic_info.florescence = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "药用价值") {
                    flower.basic_info.medicinal_value = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "工业价值") {
                    flower.basic_info.industrial_value = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "特殊用途") {
                    flower.basic_info.special_purpose = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "毒性") {
                    flower.basic_info.toxicity = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "象征意义") {
                    flower.basic_info.symbolic_significance = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "原产地") {
                    flower.basic_info.origin = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "原产地") {
                    flower.basic_info.origin = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "二名法") {
                    flower.basic_info.binomial_nomenclature = {
                        title: title[i],
                        value: value[i]
                    }
                } else if (title[i] == "英文名称﻿") {
                    flower.basic_info.en_name = {
                        title: title[i],
                        value: value[i]
                    }
                    flower.basic_info.who_founed = {
                        title: title[i],
                        value: value[i]
                    }
                }
            }
            console.log(flower);

            var flowerDao = new FlowerDao();

            flowerDao.add(flower, function (e, count) {
                console.timeEnd("turn" + index);
                console.log(count + ":" + plants[index]);
                if (e) {
                    console.log(e);
                }
                if (count == plants.length) {
                    process.exit(0);
                } else {
                    index++;
                    upsertFlowers(type);
                }
            });
        }
    });

}

//getSucculent_plants();
//getLeaf_plants();
//getFlower_plants();
//getHerb_palnts();
//getXylophyta_plants();
//getAquatic_plants();
//getHouse_plants();
//testPlants();
//getHydroponic_plants();
getCarnivorous_plants();

//var flowerDao = new FlowerDao();
//flowerDao.count(function (count) {
//    console.log("count:"+count);
//})